Tekla Open API Reference for Tekla Structures 2025
LevelMark.LevelMarkAttributes.PlacingAttributes Property
 Gets or sets the placing attributes that the object should use. Using these you can specify whether the object is automatically arranged in the drawing or not.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingAttributes PlacingAttributes { get; set; }
Public Property PlacingAttributes As PlacingAttributes
	Get
	Set
Property Value
Type: PlacingAttributes
See Also
Reference
LevelMark.LevelMarkAttributes Class
Tekla.Structures.Drawing Namespace